In [1]:
from bs4 import BeautifulSoup
import pandas as pd
import requests

In [2]:
page = requests.get('https://sos.ga.gov/elections/election_results/2010_0810/0023001.htm')
soup = BeautifulSoup(page.text, 'html.parser')

In [3]:
table = soup.find_all("table")[2]

In [4]:
df = pd.read_html(str(table), flavor='bs4')

In [5]:
df = df[1]

In [6]:
df.shape

(162, 8)

In [7]:
df.head(5)

          0     1               2               3                4   5   6   7
0       NaN   NaN  Olens  299,580  Smith  209,273  Totals  508,853 NaN NaN NaN
1       NaN   NaN           58.9%           41.1%           100.0% NaN NaN NaN
2    County   PPR             NaN             NaN              NaN NaN NaN NaN
3   APPLING  100%             781             501             1282 NaN NaN NaN
4  ATKINSON  100%              83             133              216 NaN NaN NaN

In [8]:
df = df[3:]

In [9]:
df.head(5)

          0     1    2    3     4   5   6   7
3   APPLING  100%  781  501  1282 NaN NaN NaN
4  ATKINSON  100%   83  133   216 NaN NaN NaN
5     BACON  100%  241  301   542 NaN NaN NaN
6     BAKER  100%   72   83   155 NaN NaN NaN
7   BALDWIN  100%  584  852  1436 NaN NaN NaN

In [10]:
df = df[df.columns[[0,2,3]]]

In [11]:
df.head(5)

          0    2    3
3   APPLING  781  501
4  ATKINSON   83  133
5     BACON  241  301
6     BAKER   72   83
7   BALDWIN  584  852

In [12]:
df.columns = ['county', 'Sam Olens', 'Preston W. Smith']

In [13]:
df.tail(5)

        county Sam Olens Preston W. Smith
157  WHITFIELD      2587             2827
158     WILCOX       335              326
159     WILKES       198              231
160  WILKINSON       139              227
161      WORTH       660              505

In [14]:
df = df.melt(id_vars=['county'])

In [15]:
df.columns = ['county', 'candidate', 'votes']

In [16]:
df.head()

     county  candidate votes
0   APPLING  Sam Olens   781
1  ATKINSON  Sam Olens    83
2     BACON  Sam Olens   241
3     BAKER  Sam Olens    72
4   BALDWIN  Sam Olens   584

In [17]:
df['votes'] = df['votes'].astype(int)

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 318 entries, 0 to 317
Data columns (total 3 columns):
county       318 non-null object
candidate    318 non-null object
votes        318 non-null int64
dtypes: int64(1), object(2)
memory usage: 7.5+ KB

In [19]:
df['office'] = 'Attorney General'

In [20]:
df['district'] = ''

In [21]:
df['party'] = 'Republican'

In [22]:
df.groupby(['candidate', 'party'])['votes'].sum()

candidate         party
Preston W. Smith  Republican    209273
Sam Olens         Republican    299580
Name: votes, dtype: int64

In [23]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].head()

     county            office district       party  candidate  votes
0   APPLING  Attorney General           Republican  Sam Olens    781
1  ATKINSON  Attorney General           Republican  Sam Olens     83
2     BACON  Attorney General           Republican  Sam Olens    241
3     BAKER  Attorney General           Republican  Sam Olens     72
4   BALDWIN  Attorney General           Republican  Sam Olens    584

In [24]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].to_clipboard(index=False, sep=',')